In [ ]:
import numpy as np
x=np.array([3,2,1])
x

In [ ]:
type((x))

In [ ]:
len((x))

In [ ]:
np.sort((x))

In [ ]:
x[1]

In [ ]:
np.zeros([5])

In [ ]:
np.ones(6)

In [ ]:
np.empty(7)

In [ ]:
np.arange(5)

In [ ]:
np.arange(0,5)

In [ ]:
np.arange(0,20,7)

In [ ]:
np.linspace(0,1000,num=100)

In [ ]:
np.ones(30,dtype=np.float64)

In [ ]:
y=np.array([33,33,54])
y

In [ ]:
np.concatenate((x,y))

In [ ]:
z=np.array([[1,2,3],[4,5,6],[7,8,9]])
z

In [ ]:
a=np.array([[1,2,3],[4,5,6],[7,8,9]])
a

In [ ]:
np.concatenate((z,a),axis=0)

In [ ]:
np.concatenate((z,a),axis=1)

In [ ]:
z.ndim

In [ ]:
z.size

In [ ]:
z.shape

In [ ]:
b=np.array([[1,2],[4,5]])
b

In [ ]:
c=b[:,np.newaxis]
c

In [ ]:
c=b[np.newaxis,:]
c

In [ ]:
ll=np.arange(9)
ll

In [ ]:
ll.reshape(3,3)

In [ ]:
ll.shape

In [ ]:
ll.ndim

In [ ]:
u=np.array([[[1,2,3,4],
            [5,6,7,8]],
            [[9,10,11,12],
             [13,14,15,16]]])
u

In [ ]:
u.ndim

In [ ]:
u=np.array([[1,2,3,4],
            [5,6,7,8],
            [9,10,11,12],
            [13,14,15,16]])

In [ ]:
u.ndim

In [ ]:
u.mean()

In [ ]:
u*10000

In [ ]:
np.flip(u)

In [ ]:
np.flip(h)

In [ ]:

import numpy as np
import pandas as pd

df=pd.DataFrame(
   {
      "id":np.array([1,2,3,4] ,dtype="int32"), 
       "geneder":pd.Categorical(["male","female","male","female"]),
       "address":"skp",
       "salary":np.array([200,4000,5000,1233],dtype="int32"),
    }
 )
df

In [ ]:
 df.head(2)

In [ ]:
s=pd.series([1,23,4,45])

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
s=pd.Series([1,23,4,45])
s

In [ ]:
a=pd.Series([1,3,4,5,6])

In [ ]:
import pandas as pd
x=pd.date_range("20230701",periods=5)
x

In [ ]:
dates=pd.date_range("20230701",periods=15)
dates
df=pd.DataFrame(np.random.randn(15,4),index=dates,columns=list("abcd"))
df

In [ ]:
import numpy as np
import pandas as pd

df2=pd.DataFrame(
   {
      "id":np.array([1,2,3,4]), 
       "geneder":pd.Categorical(["male","female","male","female"]),
       "address":"skp",
       "salary":np.array([2,4,5,6]),
    }
 )
df2

In [ ]:
import pandas as pd
import numpy as  np

df=pd.DataFrame(
       
     {
    
      "ID":np.array([1,2,3]),
      "Name":np.array(["ali","ahmad","bilal"]),
       "city" :"skp",
      }
 )
df

In [ ]:
df.tail(2)

In [ ]:
df.to_numpy

In [ ]:
df.dtypes

In [ ]:
df.T

In [ ]:
df.sort_index(ascending=True,axis=0)

In [ ]:
df.sort_values(by="ID",ascending=False)

In [ ]:
df.sort_values(by="ID")

In [ ]:
df["Name"]

In [ ]:
df[1:3]

In [ ]:
df.loc[0:0,["Name","city"]]

In [ ]:
df.loc[0:1,["Name","city"]]

In [ ]:
df.iloc[0:1]

In [ ]:
df.iloc[0:1,0:3]

In [ ]:
df.iloc[0:2,:]

In [ ]:
df.iloc[:,0:1]

In [ ]:
df[df["ID"]<3]

In [ ]:
df["salary"]=["2300","4400","5500"]
df

In [ ]:
mean=df[["ID","Name","city","ali","salary"]].mean()
mean

In [ ]:
df["mean"]=[ "2.=000000e+00","7.815167e+04","7.668134e+10"]
df

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
kashti=sns.load_dataset("titanic")
kashti.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
newkashti=kashti.drop(["deck","alone"],axis=1).head()
newkashti

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no

In [5]:
newkashti.groupby(['age', 'class']).mean()

C:\Users\Arbaz Arshad\AppData\Local\Temp\ipykernel_10924\68080967.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  newkashti.groupby(['age', 'class']).mean()

             survived  pclass  sibsp  parch     fare  adult_male
age  class
22.0 First        NaN     NaN    NaN    NaN      NaN         NaN
     Second       NaN     NaN    NaN    NaN      NaN         NaN
     Third        0.0     3.0    1.0    0.0   7.2500         1.0
26.0 First        NaN     NaN    NaN    NaN      NaN         NaN
     Second       NaN     NaN    NaN    NaN      NaN         NaN
     Third        1.0     3.0    0.0    0.0   7.9250         0.0
35.0 First        1.0     1.0    1.0    0.0  53.1000         0.0
     Second       NaN     NaN    NaN    NaN      NaN         NaN
     Third        0.0     3.0    0.0    0.0   8.0500         1.0
38.0 First        1.0     1.0    1.0    0.0  71.2833         0.0
     Second       NaN     NaN    NaN    NaN      NaN         NaN
     Third        NaN     NaN    NaN    NaN      NaN         NaN

In [6]:
newkashti.mean()

C:\Users\Arbaz Arshad\AppData\Local\Temp\ipykernel_10924\3775114307.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  newkashti.mean()

survived       0.60000
pclass         2.20000
age           31.20000
sibsp          0.60000
parch          0.00000
fare          29.52166
adult_male     0.40000
dtype: float64

In [8]:
kashti.value_counts(['servived'])

KeyError: 'servived'

In [9]:
kashti[kashti ["age"]<18].mean()

C:\Users\Arbaz Arshad\AppData\Local\Temp\ipykernel_10924\3245692430.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  kashti[kashti ["age"]<18].mean()

survived       0.539823
pclass         2.584071
age            9.041327
sibsp          1.460177
parch          1.053097
fare          31.220798
adult_male     0.159292
alone          0.203540
dtype: float64

In [11]:
kashti[kashti ["age"]<18].groupby(["sex","class"]).mean()

C:\Users\Arbaz Arshad\AppData\Local\Temp\ipykernel_10924\3507271767.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  kashti[kashti ["age"]<18].groupby(["sex","class"]).mean()

               survived  pclass        age     sibsp     parch        fare  \
sex    class
female First   0.875000     1.0  14.125000  0.500000  0.875000  104.083337
       Second  1.000000     2.0   8.333333  0.583333  1.083333   26.241667
       Third   0.542857     3.0   8.428571  1.571429  1.057143   18.727977
male   First   1.000000     1.0   8.230000  0.500000  2.000000  116.072900
       Second  0.818182     2.0   4.757273  0.727273  1.000000   25.659473
       Third   0.232558     3.0   9.963256  2.069767  1.000000   22.752523

               adult_male     alone
sex    class
female First     0.000000  0.125000
       Second    0.000000  0.166667
       Third     0.000000  0.228571
male   First     0.250000  0.000000
       Second    0.181818  0.181818
       Third     0.348837  0.232558